# Optional exercises
These are the optional exercises for this week's lecture. Here you can test your understanding of the content and as always we will present the solution in the __flipped classroom__.  
You do not have to run the cells with the import statement everytime, they are just meaningful if you are using the links in the notebooks.  

<img src="images/optional_exercises1.png" width="200" style="float: right;"/>

## Exercise 01 - Series

<a id='exe01a'></a>
### Exercise 01 a)  
Create a Pandas series containing ranging from 0 to 100 in 6 steps and with indices from e to j. 
Tipp: maybe the function np.linespace might help :)

In [2]:
import numpy as np
import pandas as pd

In [ ]:
# here you can write your code

<a id='exe01b'></a>
### Exercise 01 b) 
Use some fancy pandas functions so that you get the following output out of the given series.  

<img src="images/optional_exercises2.png" width="200" style="float: left;"/>

In [2]:
import numpy as np
import pandas as pd

In [8]:
# the given series
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [143]:
# your code

## Exercise 02 - DataFrames

<a id='exe02a'></a>
### Exercise 02 a) 
Filter out the state with the smalest area and then the state with the biggest area.

In [25]:
import numpy as np
import pandas as pd

In [49]:
area = pd.Series({'California': 423967, 
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995})
population = pd.Series({'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135})
states = pd.DataFrame({'population': population,
                       'area': area,
                       'country': 'USA'})
states

            population    area country
California    38332521  423967     USA
Texas         26448193  695662     USA
New York      19651127  141297     USA
Florida       19552860  170312     USA
Illinois      12882135  149995     USA

In [142]:
# the state with the smallest area

In [141]:
# the state with the biggest area

<a id='exe02b'></a>
### Exercise 02 b) 
Create a DataFrame from the given dictionary as well as the 'qualifies' list, with the given indices:

In [ ]:
import numpy as np
import pandas as pd

In [30]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    }
qualifies = ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [140]:
# your code

<a id='exe02c'></a>
### Exercise 02 c) 
Create a new index for the DataFrame from _Exercise 02 a)_. The index should contain numbers from 0 to 5.

In [139]:
# your code

## Exercise 03

<a id='exe03a'></a>
### Exercise 03 a) 
Use indexing to get the following result out of the given dataframe:  
<img src="images/optional_exercises3.png" width="250" style="float: left;"/>

In [51]:
import numpy as np
import pandas as pd

In [68]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop, 'Country':'USA'})
data

              area       pop Country
California  423967  38332521     USA
Texas       695662  26448193     USA
New York    141297  19651127     USA
Florida     170312  19552860     USA
Illinois    149995  12882135     USA

In [138]:
# your code

<a id='exe03b'></a>
### Exercise 03 b) 
Change the index of the DataFrame from _Exercise 03 a)_ so that:
- Texas and Illinois are not longer included
- Nebraska and Oregon are included  
  
and rename the column `pop` to `population`

In [137]:
# your code

<a id='exe03c'></a>
### Exercise 03 c)

Write a Pandas snippet to get the names and scores of the people where the number of attempts in the examination is greater than 2 as a dict.

In [ ]:
import numpy as np
import pandas as pd

In [89]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts' : [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [136]:
# your code

<a id='exe03d'></a>
### Exercise 03 d)
Take the DataFrame from _Exercise 03 c)_ and add a column `failed` that should be true for all that have more than two attempts.

In [135]:
# your code

<a id='exe04'></a>
## Exercise 04

Import the `countries.csv` and a pandas DataFrame and get the following information:
- count
- mean
- std
- min in each column
- the percentiles
- max in each column

Tip: there is a function that does all the job :)

In [ ]:
import numpy as np
import pandas as pd

In [134]:
# your code

## Exercise 05

<a id='exe05a'></a>
### Exercise 05 a)
Calculate the population desity from the DataFrame you created in _Exercise 03 b)_. Make sure to drop np.NaNs

In [133]:
# your code

<a id='exe05b'></a>
### Exercise 05 b)
Write a Pandas program to convert a Series of lists to one Series ("flatten" the Series).

In [80]:
s = pd.Series([['Red', 'Green', 'White'], ['Red', 'Black'], ['Yellow']])
s

0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object

In [78]:
# Sample Output: 
print(pd.Series(['Red', 'Green', 'White', 'Red', 'Black', 'Yellow']))

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [132]:
# Your code here

<a id='exe05c'></a>
### Exercise 05 c)

The given dataset contains a column `Region` as well as a column `Pop. Density`. Write a pandas code snipped that returns the `mean` of the `Pop. Density` dependent on the `Region`. Furthermore you should _sort the values_ in an ascending order and give your output an index.

Tip: Here you might have to use `groupby`

In [95]:
countries = pd.read_csv('countries.csv', index_col=0)
countries.head()

,Country,Subcontinent,Region,In EU,Population,Area,Pop. Density,Coastline,Net migration,Infant mortality,...,Phones,Arable,Crops,Other,Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,West & Central Asia,ASIA (EX. NEAR EAST),False,31056997,1.677019e+06,47.96,0.00,23.06,163.07,...,3.22,12.13,0.22,87.65,1.0,46.60,20.34,0.380,0.240,0.380
1,Albania,Europe,EASTERN EUROPE,False,3581655,7.445703e+04,124.59,1.26,-4.93,21.52,...,71.20,21.09,4.42,74.49,3.0,15.11,5.22,0.232,0.188,0.579
2,Algeria,North Africa,NORTHERN AFRICA,False,32930091,6.168683e+06,13.83,0.04,-0.39,31.00,...,78.10,3.22,0.25,96.53,1.0,17.14,4.61,0.101,0.600,0.298
3,American Samoa,Oceania,OCEANIA,False,57794,5.154080e+02,290.42,58.29,-20.71,9.27,...,259.54,10.00,15.00,75.00,2.0,22.46,3.27,NaN,NaN,NaN
4,Andorra,Europe,WESTERN EUROPE,False,71201,1.212115e+03,152.14,0.00,6.60,4.05,...,497.18,2.22,0.00,97.78,3.0,8.71,6.25,NaN,NaN,NaN

In [131]:
# your code

<a id='exe05d'></a>
### Exercise 05 d)
Take the following DataFrame and filter ot all entries with a `Coastline` smaller than 30.

In [98]:
countries = countries.dropna()
countries.head()

,Country,Subcontinent,Region,In EU,Population,Area,Pop. Density,Coastline,Net migration,Infant mortality,...,Phones,Arable,Crops,Other,Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,West & Central Asia,ASIA (EX. NEAR EAST),False,31056997,1.677019e+06,47.96,0.00,23.06,163.07,...,3.22,12.13,0.22,87.65,1.0,46.60,20.34,0.380,0.240,0.380
1,Albania,Europe,EASTERN EUROPE,False,3581655,7.445703e+04,124.59,1.26,-4.93,21.52,...,71.20,21.09,4.42,74.49,3.0,15.11,5.22,0.232,0.188,0.579
2,Algeria,North Africa,NORTHERN AFRICA,False,32930091,6.168683e+06,13.83,0.04,-0.39,31.00,...,78.10,3.22,0.25,96.53,1.0,17.14,4.61,0.101,0.600,0.298
6,Anguilla,Caribbean Islands,LATIN AMER. & CARIB,False,13477,2.641790e+02,132.13,59.80,10.76,21.03,...,460.04,0.00,0.00,100.00,2.0,14.17,5.34,0.040,0.180,0.780
7,Antigua & Barbuda,Caribbean Islands,LATIN AMER. & CARIB,False,69108,1.147366e+03,156.00,34.54,-6.15,19.46,...,549.86,18.18,4.55,77.27,2.0,16.93,5.37,0.038,0.220,0.743

In [130]:
# your code